TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_i2s.h
/* I2S_STAT Bits */
/* I2S_STAT[TXFF] Bits */
#define I2S_STAT_TXFF_OFS                        (6)                             /* !< TXFF Offset */
#define I2S_STAT_TXFF_MASK                       ((uint32_t)0x00000040U)         /* !< UART Transmit FIFO Full  The
                                                                                    meaning of this bit depends on the
                                                                                    state of the FEN bit in the CTL0
                                                                                    register. */
#define I2S_STAT_TXFF_CLEARED                    ((uint32_t)0x00000000U)         /* !< The transmitter is not full. */
#define I2S_STAT_TXFF_SET                        ((uint32_t)0x00000040U)         /* !< If the FIFO is disabled (FEN is 0),
                                                                                    the transmit holding register is
                                                                                    full. If the FIFO is enabled (FEN is
                                                                                    1), the transmit FIFO is full. */
/* I2S_STAT[RXFF] Bits */
#define I2S_STAT_RXFF_OFS                        (3)                             /* !< RXFF Offset */
#define I2S_STAT_RXFF_MASK                       ((uint32_t)0x00000008U)         /* !< UART Receive FIFO Full  The meaning
                                                                                    of this bit depends on the state of
                                                                                    the FEN bit in the CTL0 register. */
#define I2S_STAT_RXFF_CLEARED                    ((uint32_t)0x00000000U)         /* !< The receiver can receive data. */
#define I2S_STAT_RXFF_SET                        ((uint32_t)0x00000008U)         /* !< If the FIFO is disabled (FEN is 0),
                                                                                    the receive holding register is full.
                                                                                    If the FIFO is enabled (FEN is 1),
                                                                                    the receive FIFO is full. */
/* I2S_STAT[TXFE] Bits */
#define I2S_STAT_TXFE_OFS                        (5)                             /* !< TXFE Offset */
#define I2S_STAT_TXFE_MASK                       ((uint32_t)0x00000020U)         /* !< UART Transmit FIFO Empty  The
                                                                                    meaning of this bit depends on the
                                                                                    state of the FEN bit in the CTL0
                                                                                    register. */
#define I2S_STAT_TXFE_CLEARED                    ((uint32_t)0x00000000U)         /* !< The transmitter has data to
                                                                                    transmit. */
#define I2S_STAT_TXFE_SET                        ((uint32_t)0x00000020U)         /* !< If the FIFO is disabled (FEN is 0),
                                                                                    the transmit holding register is
                                                                                    empty. If the FIFO is enabled (FEN is
                                                                                    1), the transmit FIFO is empty. */
/* I2S_STAT[RXFE] Bits */
#define I2S_STAT_RXFE_OFS                        (2)                             /* !< RXFE Offset */
#define I2S_STAT_RXFE_MASK                       ((uint32_t)0x00000004U)         /* !< UART Receive FIFO Empty  The
                                                                                    meaning of this bit depends on the
                                                                                    state of the FEN bit in the CTL0
                                                                                    register. */
#define I2S_STAT_RXFE_CLEARED                    ((uint32_t)0x00000000U)         /* !< The receiver is not empty. */
#define I2S_STAT_RXFE_SET                        ((uint32_t)0x00000004U)         /* !< If the FIFO is disabled (FEN is 0),
                                                                                    the receive holding register is
                                                                                    empty. If the FIFO is enabled (FEN is
                                                                                    1), the receive FIFO is empty. */
/* I2S_STAT[RXCLR] Bits */
#define I2S_STAT_RXCLR_OFS                       (4)                             /* !< RXCLR Offset */
#define I2S_STAT_RXCLR_MASK                      ((uint32_t)0x00000010U)         /* !< RX FIFO Clear Status */
#define I2S_STAT_RXCLR_CLEARED                   ((uint32_t)0x00000000U)         /* !< FIFO is not cleared */
#define I2S_STAT_RXCLR_SET                       ((uint32_t)0x00000010U)         /* !< FIFO clear is complete */
/* I2S_STAT[TXCLR] Bits */
#define I2S_STAT_TXCLR_OFS                       (7)                             /* !< TXCLR Offset */
#define I2S_STAT_TXCLR_MASK                      ((uint32_t)0x00000080U)         /* !< TX FIFO Clear Status */
#define I2S_STAT_TXCLR_CLEARED                   ((uint32_t)0x00000000U)         /* !< FIFO is not cleared */
#define I2S_STAT_TXCLR_SET                       ((uint32_t)0x00000080U)         /* !< FIFO clear is complete */

/* I2S_IFLS Bits */
/* I2S_IFLS[TXIFLSEL] Bits */
#define I2S_IFLS_TXIFLSEL_OFS                    (0)                             /* !< TXIFLSEL Offset */
#define I2S_IFLS_TXIFLSEL_MASK                   ((uint32_t)0x00000007U)         /* !< FIFO Level Select for generating
                                                                                    events (interrupt/dma).  Note: for
                                                                                    undefined settings the default
                                                                                    configuration is used. */
#define I2S_IFLS_TXIFLSEL_LVL_3_4                ((uint32_t)0x00000001U)         /* !< TX FIFO <= 3/4 empty */
#define I2S_IFLS_TXIFLSEL_LVL_1_2                ((uint32_t)0x00000002U)         /* !< TX FIFO <= 1/2 empty (default) */
#define I2S_IFLS_TXIFLSEL_LVL_1_4                ((uint32_t)0x00000003U)         /* !< TX FIFO <= 1/4 empty */
#define I2S_IFLS_TXIFLSEL_LVL_EMPTY              ((uint32_t)0x00000005U)         /* !< TX FIFO is empty */
#define I2S_IFLS_TXIFLSEL_LVL_ALMOST_EMPTY       ((uint32_t)0x00000006U)         /* !< TX FIFO <= 1 */
#define I2S_IFLS_TXIFLSEL_LVL_ALMOST_FULL        ((uint32_t)0x00000007U)         /* !< TX_FIFO >= (MAX_FIFO_LEN -1) */
/* I2S_IFLS[RXIFLSEL] Bits */
#define I2S_IFLS_RXIFLSEL_OFS                    (4)                             /* !< RXIFLSEL Offset */
#define I2S_IFLS_RXIFLSEL_MASK                   ((uint32_t)0x00000070U)         /* !< UART Receive Interrupt FIFO Level
                                                                                    Select  The trigger points for the
                                                                                    receive interrupt are as follows:
                                                                                    Note:    In ULP domain the trigger
                                                                                    levels are used for:   0: LVL_1_4
                                                                                    4: LVL_FULL   For undefined settings
                                                                                    the default configuration is used. */
#define I2S_IFLS_RXIFLSEL_LVL_1_4                ((uint32_t)0x00000010U)         /* !< RX FIFO >= 1/4 full */
#define I2S_IFLS_RXIFLSEL_LVL_1_2                ((uint32_t)0x00000020U)         /* !< RX FIFO >= 1/2 full (default) */
#define I2S_IFLS_RXIFLSEL_LVL_3_4                ((uint32_t)0x00000030U)         /* !< RX FIFO >= 3/4 full */
#define I2S_IFLS_RXIFLSEL_LVL_FULL               ((uint32_t)0x00000050U)         /* !< RX FIFO is full */
#define I2S_IFLS_RXIFLSEL_LVL_ALMOST_FULL        ((uint32_t)0x00000060U)         /* !< RX_FIFO >= (MAX_FIFO_LEN -1) */
#define I2S_IFLS_RXIFLSEL_LVL_ALMOST_EMPTY       ((uint32_t)0x00000070U)         /* !< RX_FIFO <= 1 */
/* I2S_IFLS[TXCLR] Bits */
#define I2S_IFLS_TXCLR_OFS                       (3)                             /* !< TXCLR Offset */
#define I2S_IFLS_TXCLR_MASK                      ((uint32_t)0x00000008U)         /* !< TX FIFO CLEAR. Setting this bit
                                                                                    will clear the TX FIFO contents. */
#define I2S_IFLS_TXCLR_DISABLE                   ((uint32_t)0x00000000U)         /* !< Disable FIFO clear */
#define I2S_IFLS_TXCLR_ENABLE                    ((uint32_t)0x00000008U)         /* !< Enable FIFO Clear */
/* I2S_IFLS[RXCLR] Bits */
#define I2S_IFLS_RXCLR_OFS                       (7)                             /* !< RXCLR Offset */
#define I2S_IFLS_RXCLR_MASK                      ((uint32_t)0x00000080U)         /* !< RX FIFO CLEAR. Setting this bit
                                                                                    will clear the RX FIFO contents. */
#define I2S_IFLS_RXCLR_DISABLE                   ((uint32_t)0x00000000U)         /* !< Disable FIFO clear */
#define I2S_IFLS_RXCLR_ENABLE                    ((uint32_t)0x00000080U)         /* !< Enable FIFO Clear */

